# parameters
nc: 3  # number of classes
depth_multiple: 1.0  # model depth multiple
width_multiple: 1.0  # layer channel multiple

# anchors
anchors:
  - [12,16, 19,36, 40,28]  # P3/8
  - [36,75, 76,55, 72,146]  # P4/16
  - [142,110, 192,243, 459,401]  # P5/32

# cst-yolo backbone
backbone:
  # [from, number, module, args]
  [[-1, 1, Conv, [32, 3, 1]],  # 0

   [-1, 1, Conv, [64, 3, 2]],  # 1-P1/2
   [-1, 1, Conv, [64, 3, 1]],  # 2

   [-1, 1, Conv, [128, 3, 2]],  # 3-P2/4

   [-1, 1, Conv, [64, 1, 1]],  # 4    W-ELAN 3
   [-2, 1, Conv, [64, 1, 1]],  # 5
   [-1, 1, Conv, [64, 3, 1]],  # 6
   [-1, 1, Conv, [64, 3, 1]],  # 7
   [[-1, -2, -3, -4], 1, MyConcat4, [1]],  # 8
   [-1, 1, Conv, [256, 1, 1]],  # 9

   [-1, 1, Conv, [256, 3, 2]],  # 10  CBSConcat
   [-1, 1, Conv, [128, 1, 1]],  # 11
   [-3, 1, Conv, [128, 1, 1]],  # 12
   [-1, 1, Conv, [128, 3, 2]],  # 13
   [[-1, -3], 1, Concat, [1]],  # 14
  

   [-1, 1, Conv, [128, 1, 1]],  # 15  W-ELAN 3 
   [-2, 1, Conv, [128, 1, 1]],  # 16
   [-1, 1, Conv, [128, 3, 1]],  # 17
   [-1, 1, Conv, [128, 3, 1]],  # 18
   [[-1, -2, -3, -4], 1, MyConcat4, [1]],  # 19
   [-1, 1, Conv, [512, 1, 1]],  # 20

   [-1, 1, Conv, [256, 3, 2]],  # 21  CBSConcat
   [-1, 1, Conv, [256, 1, 1]],  # 22
   [-3, 1, Conv, [256, 1, 1]],  # 23
   [-1, 1, Conv, [256, 3, 2]],  # 24
   [[-1, -3], 1, Concat, [1]],  # 25
   [-1, 1, CST, [512 ]],  # 26        CST

   [-1, 1, Conv, [256, 1, 1]],  # 27  W-ELAN 3
   [-2, 1, Conv, [256, 1, 1]],  # 28
   [-1, 1, Conv, [256, 3, 1]],  # 29
   [-1, 1, Conv, [256, 3, 1]],  # 30
   [[-1, -2, -3, -4], 1, MyConcat4, [1]],  # 31
   [-1, 1, Conv, [1024, 1, 1]],  # 32

   [-1, 1, Conv, [512, 3, 2]],  # 33  CBSConcat
   [-1, 1, Conv, [512, 1, 1]],  # 34
   [-3, 1, Conv, [512, 1, 1]],  # 35
   [-1, 1, Conv, [512, 3, 2]],  # 36
   [[-1, -3], 1, Concat, [1]],  # 37

   [-1, 1, Conv, [256, 1, 1]],  # 38  W-ELAN 3
   [-2, 1, Conv, [256, 1, 1]],  # 39
   [-1, 1, Conv, [256, 3, 1]],  # 40
   [-1, 1, Conv, [256, 3, 1]],  # 41
   [[-1, -2, -3, -4], 1, MyConcat4, [1]],  # 42
   [-1, 1, Conv, [1024, 1, 1]],  # 43
   [-1, 1, MCS, [1024 ]],  # 44
  ]

# cst-yolo neck & head
head:
  [[-1, 1, SPPCSPC, [512]],  # 45

   [-1, 1, Conv, [256, 1, 1]],  # 46
   [-1, 1, nn.Upsample, [None, 2, 'nearest']],  # 47  Upsample
   [32, 1, Conv, [256, 1, 1]],  # 48
   [[-1, -2], 1, Concat, [1]],  # 49

   [-1, 1, Conv, [256, 1, 1]],  # 50  W-ELAN 2
   [-2, 1, Conv, [256, 1, 1]],  # 51
   [-1, 1, Conv, [128, 3, 1]],  # 52
   [-1, 1, Conv, [128, 3, 1]],  # 53
   [-1, 1, Conv, [128, 3, 1]],  # 54
   [-1, 1, Conv, [128, 3, 1]],  # 55
   [[-1, -2, -3, -4, -5, -6], 1, MyConcat6, [1]],  # 56
   [-1, 1, Conv, [256, 1, 1]],  # 57

   [-1, 1, Conv, [128, 1, 1]],  # 58
   [-1, 1, nn.Upsample, [None, 2, 'nearest']],  # 59  Upsample
   [20, 1, Conv, [128, 1, 1]],  # 60
   [[-1, -2], 1, Concat, [1]],  # 61

   [-1, 1, Conv, [128, 1, 1]],  # 62  W-ELAN 2
   [-2, 1, Conv, [128, 1, 1]],  # 63
   [-1, 1, Conv, [64, 3, 1]],  # 64
   [-1, 1, Conv, [64, 3, 1]],  # 65
   [-1, 1, Conv, [64, 3, 1]],  # 66
   [-1, 1, Conv, [64, 3, 1]],  # 67
   [[-1, -2, -3, -4, -5, -6], 1, MyConcat6, [1]],  # 68
   [-1, 1, Conv, [128, 1, 1]],  # 69

   [-1, 1, Conv, [128, 3, 2]],  # 70  CatConv
   [-1, 1, Conv, [128, 1, 1]],  # 71
   [-3, 1, Conv, [128, 1, 1]],  # 72
   [-1, 1, Conv, [128, 3, 2]],  # 73
   [61, 1, Conv, [128, 3, 2]],  # 74 add
   [[-1,-2, -4, 45], 1, MyConcat4, [1]],  # 75

   [-1, 1, Conv, [256, 1, 1]],  # 76  W-ELAN 2
   [-2, 1, Conv, [256, 1, 1]],  # 77
   [-1, 1, Conv, [128, 3, 1]],  # 78
   [-1, 1, Conv, [128, 3, 1]],  # 79
   [-1, 1, Conv, [128, 3, 1]],  # 80
   [-1, 1, Conv, [128, 3, 1]],  # 81
   [[-1, -2, -3, -4, -5, -6], 1, MyConcat6, [1]],  # 82
   [-1, 1, Conv, [256, 1, 1]],  # 83

   [-1, 1, Conv, [256, 3, 2]],  # 84  CatConv
   [-1, 1, Conv, [256, 1, 1]],  # 85
   [-3, 1, Conv, [256, 1, 1]],  # 86
   [-1, 1, Conv, [256, 3, 2]],  # 87
   [49, 1, Conv, [256, 3, 2]],  # 88
   [[-1,-2, -4, 45], 1, MyConcat4, [1]],  # 89

   [-1, 1, Conv, [512, 1, 1]],  # 90  W-ELAN 2
   [-2, 1, Conv, [512, 1, 1]],  # 91
   [-1, 1, Conv, [256, 3, 1]],  # 92
   [-1, 1, Conv, [256, 3, 1]],  # 93
   [-1, 1, Conv, [256, 3, 1]],  # 94
   [-1, 1, Conv, [256, 3, 1]],  # 95
   [[-1, -2, -3, -4, -5, -6], 1, MyConcat6, [1]],  # 96
   [-1, 1, Conv, [512, 1, 1]],  # 97

   [77, 1, RepConv, [256, 3, 1]],  # 98
   [91, 1, RepConv, [512, 3, 1]],  # 99
   [105, 1, RepConv, [1024, 3, 1]],  # 100

   [[106,107,108], 1, IDetect, [nc, anchors]],   # 101
  ]
